{"pie_madness_local": [{"PutRequest": {"Item": {"secret": {"S": "02fef1e7-a19f-4037-ba2f-a54931a4581c"}, "image": {"S": "https://pie-madness.s3.amazonaws.com/c6061bb8-5ccb-4090-b3d4-100db1fa071a.jpg"}, "lastName": {"S": "hemerlein"}, "timestamp": {"N": "1643753475085"}, "favoritePie": {"S": "pumpkin"}, "user": {"S": "dan hemerlein"}, "SK": {"S": "USER#861f4f6d-4ca1-44af-b05c-25735ed4deca"}, "PK": {"S": "USER#861f4f6d-4ca1-44af-b05c-25735ed4deca"}, "firstName": {"S": "dan"}}}}, {"PutRequest": {"Item": {"secret": {"S": "c41dba65-b6a7-48a6-82b8-6dcb4c1ca5d3"}, "image": {"S": "https://pie-madness.s3.amazonaws.com/a8594c61-ebed-493e-b4fa-e2224d61f68c.jpg"}, "lastName": {"S": "Shastri"}, "timestamp": {"N": "1614012055587"}, "favoritePie": {"S": "Key Lime"}, "user": {"S": "Gaurav Shastri"}, "SK": {"S": "USER#df2a360a-ded9-4129-9d60-5adb4883bcbc"}, "PK": {"S": "USER#df2a360a-ded9-4129-9d60-5adb4883bcbc"}, "firstName": {"S": "Gaurav"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1647187797929"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#48a60167-47b8-49bd-be72-13d8f18c3e86"}, "text": {"S": "**Strawberry Rhubarb (1) over Blueberry Peach (4), 21-14**\n\nIt remains unclear whether Blueberry Peach will ever come into its own, but for now Strawberry Rhubarb takes it home and is showing everyone why it was billed as the pie to beat. \n\n**Maple Bourbon Brown Butter Peach (3) over Banoffee (2), 22-14**\n\nMB3P pulls out with a victory over Banoffee in this second round matchup. These pies had never battled against each other before and this round showed that MB3P has the edge. If MB3P is able to overtake Strawberry Rhubarb in the next round, then it’ll make its 3rd ever Final Four.\n\n**Maple Pecan Cream (4) over Oreo Nutella (1), 25-11**\n\nWell, it finally happened. Oreo Nutella has lost in a voting round. It took rookie pie Maple Pecan Cream in a surprisingly decisive vote as this ties the biggest victory this round. Oreo Nutella is still clearly a top pie, but fans of the pie hope this loss doesn’t signify the beginning of its downfall. MPC on the other hand is very quickly trending upwards as this year’s new “it” pie.\n\n**Lemon Raspberry (2) over Peanut Butter (3), 20-15**\n\nIn this light n fruity vs creamy and sweet matchup, Lemon Raspberry takes the victory and continues its surprising run from a year ago. Since the pie tasted nice and refreshing last year, it’ll have and interesting matchup against the more wintery MPC in the next round.\n\n**Mississippi Mud (1) over Sweet Potato (4), 20-15**\n\nAs the premier chocolate pie, Mississippi Mud has the full support of chocolate fans, and it needed it all for this matchup against classic American pie Sweet Potato. Fans of Sweet Potato are once against disappointed by this showing, but they can’t be too discouraged as the pie put up a good fight against one of the top pies in the tournament.\n\n**Key Lime (2) over Strawberry Cheesecake (3) 24-12**\n\nKey Lime has a momentum like its never had before, and here it rode past Strawberry Cheesecake easily. While some pie fans are debating whether Strawberry Cheesecake pie should even be in the tournament, Key Lime is preparing for the biggest matchup of its life against top pie Mississippi Mud.\n\n**Blueberry (1) over Guava Cream Cheese Handpies (4), 21-15**\n\nIt was close in the beginning, but in the end Blueberry was able to take a victory over the uniquely shaped Guava Cream Cheese Handpies. With Blueberry once again making a deep tournament run, it’s now just one victory away from its 4th Final Four appearance\n\n**Chocolate Pretzel (6) over Apple (2), 24 -12**\n\nOnce again the biggest upset is saved for last as Chocolate Pretzel shocks the world by beating Apple in the biggest upset of this tournament so far. It may be too early to start thinking about 2023 but Apple definitely has some thinking to do for whether it will stay with its traditional ways or try to change things up as it tries to fix its lack of tournament victories. Chocolate Pretzel on the other hand is hoping it can pull off one more shocking upset to make the Final Four."}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Round 2 Results!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1644615940600"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#4dc7288c-d497-4658-a30b-c972b403f94c"}, "text": {"S": "Are you excited for a new Pie Madness tournament?!"}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Welcome to Pie Madness 2022"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": "https://pie-madness.s3.amazonaws.com/82c0ca25-7f38-4bfb-bf75-e36b78bf99a2.png"}, "number": {"N": "0"}, "timestamp": {"N": "1645570657938"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#762604e4-222a-443e-a690-8c702536950d"}, "text": {"S": "Pie Madness 2022 is under way! Below is the 2022 bracket. If you want to participate in the 2022 bracket contest, you can download a fillable PDF version of the bracket below. Just predict what you think the results will be and send your filled bracket to [brackets@piemadness.com](mailto:brackets@piemadness.com). The winner of the bracket contest gets to join the 2023 Pie Madness Selection Committee and help craft the 2023 Pie Madness Bracket! Full rules for the bracket contest are in the about section.\n\nThe schedule for the 2022 contest will be\n\n- First Round: March 1-6\n- Second Round: March 7-12\n- Third Round: March 13-18\n- Final Four: TBA, likely March 27\n\n[Click here to download a blank 2022 Pie Madness bracket](https://www.dropbox.com/s/ixocl62nwol6xox/PieMadness2022BracketForDownload.pdf?dl=0)\n\nWhich pies are you excited about? What’s disappointing about this bracket? LET’S HEAR IT"}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Pie Madness 2022!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1646667424655"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#7d43ce21-2bb8-4877-8ee0-5b7e71aa1740"}, "text": {"S": "Voting for Round 2 has now begun! Click the link below to vote.\n\n[ROUND 2 VOTING](https://docs.google.com/forms/d/e/1FAIpQLSdAls7HgLeDinzHVQcGOwhwepjIlQMYafRcz3mDSgTwJmyOVA/viewform?usp=sf_link)"}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Round 2 Begins!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1647139552604"}, "user": {"S": "USER#861f4f6d-4ca1-44af-b05c-25735ed4deca"}, "SK": {"S": "POST#9d62953f-99e4-4abd-8f4f-f261cdd49016"}, "text": {"S": "uhhhhhhh"}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "test"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1646660961136"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#bea5a94e-21c7-491f-8dff-b7e1373e070e"}, "text": {"S": "**Strawberry Rhubarb (1) over Black Bottom Oatmeal (8), 20-8**\n\nBlack Bottom Oatmeal put up a decent showing against a tough opponent, but no surprises here as the #1 overall pie Strawberry Rhubarb overtakes BBO in a matchup that wasn’t very close\n\n**Blueberry Peach (4) over Lemon Meringue (5), 16-12**\n\n4 vs 5 seed matchups are usually quite close and this was no different. The voting was a little back and forth in the beginning but Blueberry Peach ultimately pulled away with most of the last votes.\n\n**Maple Bourbon Brown Butter Peach (3) over Apple Cranberry (6), 23-5**\n\nIs this the comeback year for MB3P? Not only has the pie received some extra attention from the pie community, but it also easily handled last year’s surprise victor Apple Cranberry.\n\n**Banoffee (2) over Dragonfruit (7), 16-12**\n\nBanoffee has been trending upwards since last year’s Enjoyable Eight appearance, but the return of Dragonfruit almost spoiled everything. In the end, Banoffee came through with most of the final votes and is ready for a tough matchup against MB3P.\n\n**Oreo Nutella (1) over Crust (8), 18-10**\n\nCrust followers were excited about this matchup against the commonly disliked Oreo Nutella, but once again the Oreo Nutella fans came out to vote and left Crust in the dust. ON remains undefeated in online head to head matchups.\n\n**Maple Pecan Cream (4) vs Mixed Berry (5), 20-8**\n\nMPC came out of the gate fast garnering almost all of the first 10 votes and never looked back. This new pie is now the lone remaining cream pie and has an interesting matchup against Oreo Nutella next round.\n\n**Peanut Butter (3) over Chai (6), 15-13**\n\nThere was lots of pre-tournament excitement for Chai Pie, but it faced a tough matchup against cult classic Peanut Butter Pie and ultimately couldn’t overcome its creamy peanut butter flavors in this barnburner.\n\n**Lemon Raspberry (2) over Rum Raisin Pecan (7), 19-9**\n\nReturning champions don’t often go very far in Pie Madness, but Lemon Raspberry has at least gotten past the first round over new creation Rum Raisin Pecan. Is it time for Lemon Raspberry to make another run?\n\n**Mississippi Mud (1) over Sour Orange (8), 16-12**\n\nThis was nearly a shocker! Sour Orange came out and took a solid lead over top pie Mississippi Mud, but ultimately the chocolately popularity of Mud prevailed in this nail biter. \n\n**Sweet Potato (4) over Chocolate Cherry Chess (5), 18-10**\n\nThere’s a lot of hope for Sweet Potato this year as it returns to its traditional self and kicks off with a victory over troubled Chocolate Cherry Chess. It was a close one, but Chocolate Cherry Chess now has two first round exits after winning the whole competition in 2020 and stands to not be included in 2023.\n\n**Strawberry Cheesecake (3) over Piña Colada (6), 19-9**\n\nThough the thought of a cheesecake pie doesn’t sit well with every pie fan, Strawberry Cheesecake has at least been able to take out Coconut Cream replacement Piña Colada in a matchup that was never very close to begin with.\n\n**Key Lime (2) vs Chocolate Orange Chess (7), 20-8**\n\nKey Lime fans swear 2022 is finally their year, and it’s hard to find any argument against that. With one of the biggest margin of victories in the first round and plenty of buzz in the community, Key Lime is focused on Strawberry Cheesecake and ready for more.\n\n**Blueberry (1) over Peanut Pie with Coca Cola Glaze (8), 22-6**\n\nBlueberry has been one of the premier pies of the tournament and it showed that here with an easy victory. Plenty of pie fans started talking about Peanut with Coca Cola Glaze, but was it positive? Remains to be seen whether the pie will return for another year.\n\n**Guava Cream Cheese Handpies (4) over Spiced Pumpkin (5), 15-13**\n\nIt was a close one throughout with some back and forth, but Guava Cream Cheese was able to hold on over Spiced Pumpkin. This marks the first ever victory for Guava Cream Cheese Handpies.\n\n**Chocolate Pretzel (6) over Banana Cream (3) , 17-10**\n\nBanana Cream hasn’t fared well since its Final Four appearance in 2018 now with only 2 wins in its last 4 years. Believe it or not, this marks the biggest upset of the first round.\n\n**Apple (2) over Cookie Dough Ice Cream (7), 14-13**\n\nAnd to close out the first round we have what was almost the biggest shocker of the tournament so far. Rookie pie Cookie Dough Ice Cream came within one vote of the conventionally popular Apple. This matchup was close throughout but Cookie Dough Ice Cream held its lead since the start. It wasn’t until the last few hours that Apple started surging and took the lead with just 2 hours remaining."}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Round 1 Results!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1647614852054"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#bfa90c42-4261-4ddc-be37-65923ed643a2"}, "text": {"S": "**Maple Bourbon Brown Butter Peach (3) over Strawberry Rhubarb (1), 19-14**\n\nSince the beginning of Pie Madness, no pie has ever won it all multiple times. Strawberry Rhubarb was on a mission to change that this year with a sense of renewed energy, but this upset showed that there’s another former champion that might have what it takes. Maple Bourbon Brown Butter Peach has been a fan favorite since it burst on to the pie scene and won it all in 2019, but has since been disappointing minus one Final Four appearance in 2020. This victory flips the script against Strawberry Rhubarb as MB3P is now primed to be a repeat champion with its past experience. It’s not just the only pie in the 2022 Final Four who has won it all before, but is also the only pie who has ever been in a Final Four before.\n\n**Maple Pecan Cream (4) over Lemon Raspberry (2), 21-12**\n\nThis matchup put the surprisingly successful mid-seeded Maple Pecan Cream against the surprise mid-seeded winner of last year, Lemon Raspberry. In the most decisive victory of this round, Maple Pecan Cream came out on top over the deliciously refreshing Lemon Raspberry. As the only remaining representative of cream pies and the ghost Pecan pie, it appears as though MPC has successfully brought together different creeds of pie fans and will have a go in the final round.\n\n**Key Lime (2) over Mississippi Mud (1), 19-14**\n\nIt’s the Final Four at last for Key Lime. Key Lime has been a strong contender every year but has always fallen just short of the final round. From the start, 2022 has felt different for the pie as KL has garnered a special amount of hype it hasn’t seen in previous years. This victory over Mississippi Mud cements that 2022 is a special year for Key Lime and signals that the famous chocolate pie may be getting a little stale for some pie fans. Key Lime now enters the Final Four as the favorite to win it all.\n\n**Chocolate Pretzel (6) over Blueberry (1), 17-16**\n\nAnd once again, thanks to Chocolate Pretzel, the last result here is the biggest upset. The first two upsets by Chocolate Pretzel over Banana Cream and Apple were quite surprising, but it didn’t feel like anything would come of it. This one-vote win by Chocolate Pretzel over top-seeded Blueberry puts CP in a whole other conversation as it’s proven that it’s serious. With the fall of Mississippi Mud, chocolate fans will surely flock towards Chocolate Pretzel to give it a boost in the final round."}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Round 2 Results!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1647188872165"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#e774b32a-9443-4407-bf35-890d95bb508a"}, "text": {"S": "Voting for Round 3 has now begun! Click the link below to vote.\n\n[ROUND 3 VOTING](https://docs.google.com/forms/d/e/1FAIpQLSfEfgqVHNGOrEVCo9Gs1Dl6pcAEiJ596Js4c-HrkaE62-RAvg/viewform?usp=sf_link)"}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Round 3 Begins!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1646141684623"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#fe13fbcb-054e-48b0-ac11-612d11e56a9a"}, "text": {"S": "Voting for Round 1 has now begun! Click the link below to vote.\n\n[ROUND 1 VOTING](https://docs.google.com/forms/d/e/1FAIpQLSc3m2zxtR6YSouXtkzQ8kVV3OvPJMOZyxjlG_e_aPG61kkWHw/viewform?usp=sf_link)\n\nAdditionally, the due date to submit a bracket for the bracket contest has been extended to midnight on March 4! Submit a bracket by downloading one [here](https://www.dropbox.com/s/ixocl62nwol6xox/PieMadness2022BracketForDownload.pdf?dl=0) filling it out on a computer and sending it to brackets@piemadness.com. If you are having trouble figuring out how to submit a bracket or don't have access to a computer the commissioner can help! Just send an email to commish@piemadness.com"}, "PK": {"S": "POST#CONTEST#2022"}, "title": {"S": "Round 1 begins!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1678548584454"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#20788218-0907-4e14-bca6-68f36aee38f9"}, "text": {"S": "**Key Lime (1) defeats Banana Cream (5), 31-26**\n\nBanana Cream started with a big lead of almost 10 votes but eventually succumbed to the tart and creamy flavor of Key Lime. Banana Cream Beleivers hope to start a stronger campaign next year.\n\n**Maple Pecan Cream (2) defeats Lemon Raspberry Chiffon (3), 31-26**\n\nThis matchup was neck and neck the whole way, but Maple Pecan Cream emerged victorious with a big surge on the final day. The Key Lime region is now guaranteed to have a Final Four pie from 2022.\n\n**Maple Bourbon Brown Butter Peach (1) defeats Peanut Butter (4), 37-19**\n\nThis matchup was never very close as MB3P is now 1 round away from yet another Final Four. Peanut Butter fans simply did not come out very strong this year\n\n**Blueberry (2) defeats Coconut Cream (6), 31-26**\n\nCoconut Cream had a big lead to start off as fans of cream pies voted early, but the premier Single Berry Pie slowly worked its way to a tie on the second to last day then pulled away with the final votes.\n\n**Strawberry Rhubarb (1) defeats Sweet Potato (4), 40-17**\n\nThe biggest blowout of the second round, Sweet Potato never had a chance against the perfect combination of sweet and tart in Strawberry Rhubarb. Strawberry Rhubarb is now heavily favored to make the Final Four for the fourth time in its career.\n\n**Blood Orange Ricotta (7) defeats Pecan (6), 32-25**\n\nIn the battle of the underdogs the bigger underdog won this round. BOR took a massive first half lead and, though Pecan was able to work back within 7 votes, it wasn’t enough to catch this rookie pie that’s starting to turn the heads of pie fans everywhere\n\n**Mississippi Mud (1) defeats Strawberry Cheesecake (4), 33-24**\n\nChocolate pie fans rejoice as their premier pie Mississippi Mud beats Strawberry Cheesecake. Though the final score indicates a somewhat close contest, Strawberry Cheesecake never got too close to threatening Mississippi Mud in this one.\n\n**Bayou Goo (7) defeats Coffee Banoffee (3), 32-25**\n\nBanoffee was unable to reach the Enjoyable Eight for the first time since 2021, but its still found a great flavormate in coffee. It's possible the pie just ran into a buzzsaw in rookie sensation Bayou Goo. Bayou Goo now has a tough and murky matchup against fellow chocolate pie Mississippi Mud.\n"}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Round 2 Results!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1678114469426"}, "user": {"S": "USER#da6404a0-d32c-4e05-8377-319c274c3254"}, "SK": {"S": "POST#22ae89f0-6c9e-46c1-8714-6d40364f3a68"}, "text": {"S": "Second round voting is now open!\n[Click here](https://forms.gle/X2UaXKptLV6dhcKC9) to vote for your favorite pies by March 10"}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Second Round Voting"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1678939497802"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#2354b2e5-79f1-4510-bd58-ba15bb8ac1f5"}, "text": {"S": "**Key Lime (1) over Maple Pecan Cream (2), 29-16**\n\nMPC justified its 2 seed with an Enjoyable Eight appearance but is unable to match its Final Four run from last year as it runs into last year’s champion Key Lime. Key Lime started the first five years of Pie Madness without a single Final Four appearance but has now turned in 2 straight runs to the final showdown. No pie has ever won Pie Madness twice and Key Lime now has a golden opportunity to do the unthinkable and win two straight Pie Madnesses.\n\n**Maple Bourbon Brown Butter Peach (1) over Blueberry (2), 26-19**\n\nComing into this matchup, both MB3P and Blueberry were tied (along with Strawberry Rhubarb) for the most Final Four appearances with 3. With a big victory here, MB3P is now the first pie to ever make 4 Final Fours with this symbolic victory over Blueberry and has accomplished this feat with a 2 year disadvantage as the pie didn’t debut until 2019. With a victory in the Final Four, MB3P would cement itself as the undisputed most successful pie in Pie Madness History.\n\n**Blood Orange Ricotta (7) over Strawberry Rhubarb (1), 31-14**\n\nThis is what Pie Madness is all about! An upset for the ages as Blood Orange Ricotta demolished Strawberry Rhubarb with one of the biggest margins of victory we’ve seen all tournament. Nobody could have seen this coming as the rookie Blood Orange Ricotta pulled off upsets at every turn and now finishes off its miraculous online voting run with a commanding victory over one of the most storied pies in Pie Madness history.\n\n**Bayou Goo (7) over Mississippi Mud (1), 29-16**\n\nAnother 7 seed beating a 1 seed, this one is slightly less surprising given the matchup and pre-tournament buzz for the #GooCrew though a shocker nonetheless. Bayou Goo proved to the Pie Selection Committee that it deserved a debut better than a 7 seed by making the Enjoyable Eight and now has a chance to win the whole tournament. Mississippi Mud goes home no longer sure if it’s the premier chocolate pie as Bayou Goo offers chocolate as well as cheesecake and pecans."}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Third round results!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1678082566096"}, "user": {"S": "USER#da6404a0-d32c-4e05-8377-319c274c3254"}, "SK": {"S": "POST#3a9d02dd-ae40-49ef-9cc5-3f81540c0845"}, "text": {"S": "Key Lime (1) defeats Tropical Key Lime (8), 32-21\nLast year’s champion goes against a comparable competitor and has no problems moving on\n\nBanana Cream (5) defeats Brown Butter Apple with Cheddar (4), 32-22\nIn what was the closest matchup of the first round for most of the week, Banana Cream pulls away with a last minute victory with a massive streak at the end to pull away with a 10 vote win\n\nLemon Raspberry Chiffon (3) defeats Chai (6), 30-24\nFor most of the final day Chai had a thin lead, but Lemon Raspberry Chiffon skims by the upstart Chai taking most of the final votes.\n\nMaple Pecan Cream (2) defeats Dragonfruit Ice Cream w Brownie (7), 41-13\nDragonfruit fans thought they had the combo of the future, but instead they got blown out in the most lopsided matchup of the first round \n\nMaple Bourbon Brown Butter Peach (1) defeats Irish Coffee Crème Brûlée (8), 34-20\nIrish Coffee Crème Brûlée had an early lead, but the star power of the most successful pie in Pie Madness history was too much to overcome.\n\nPeanut Butter (4) defeats Blackberry (5), 29-25\nAnother barn burner that went back and forth, Peanut Butter moves on and looks forward to a tough 2nd round matchup.\n\nCoconut Cream (6) defeats Chocolate Pretzel (3), 30-24\nAfter a year off Coconut Cream looks rested and pulls off a sizable upset defeating last year’s Final Four chocolate darling \n\nBlueberry (2) defeats Cookie Dough Ice Cream (7), 37-16\nThis one wasn’t a fair fight as the premier SBP (Single Berry Pie) easily takes down CDIC\n\nStrawberry Rhubarb (1) defeats Sour Orange (8), 38-15\nCitrus pies may be in style, but that doesn’t mean Sour Orange can take down fan favorite Strawberry Rhubarb\n\nSweet Potato (4) defeats Peach Handpies (5), 35-19\nHandpies haven’t had the most success in Pie Madness and Peach will second guessing it’s decision to team up with them all offseason long.\n\nPecan (6) defeats Strawbrie Handpies (3), 31-23\nBig upset win for Pecan as Pecan fans must feel justified with their calls to have been seeded higher.\n\nBlood Orange Ricotta (7) defeats Chocolate Cream with Oreo (2), 31-23\nThis might be the biggest upset of the first round. Chocolate Cream with Oreo thought it made an improvement by dropping Nutella, but instead it loses in shocking fashion to rookie pie Blood Orange Ricotta\n\nMississippi Mud (1) defeats Mint Chocolate Chip (8), 36-18\nThis chocolate v chocolate matchup ends up with Mississippi Mud asserting its chocolate dominance\n\nStrawberry Cheesecake (4) defeats Lemon Meringue (5), 27-26\nThe closest matchup of the whole first round, these two pies see sawed back and forth with the lead until the clock struck midnight and Strawberry Cheesecake happened to hold the lead by one vote \n\nCoffee Banoffee (3) defeats Very Peary Cherry (6), 31-23\nVery Peary Cherry had a strong showing as a graveyard pie last year, and it enjoyed a sizable lead throughout the week, but Coffee Banoffee went on a big streak of the week at the end to put an end to this otherwise close matchup\n\nBayou Goo (7) defeats Apple (2), 30-24\nThe final matchup of the first round, and it ends with a bang. Bayou Goo marks its entrance to the tournament with a massive victory over world famous Apple. Bayou Goo started with a big lead and Apple came within a couple votes mid week but couldn’t complete the victory. "}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Round 1 Results!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "poll": {"S": ""}, "image": {"S": ""}, "timestamp": {"N": "1677012054998"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#46b54557-b4fb-4755-8565-dbf4cb110367"}, "text": {"S": "Are you ready for Pie Madness 2023!? Below is the 2023 bracket. To participate in the 2023 bracket contest, you can download a PDF version of the bracket below. Just predict what you think the results will be and send your filled bracket to [brackets@piemadness.com](mailto:brackets@piemadness.com). The winner of the bracket contest gets to join the 2024 Pie Madness Selection Committee and help craft the 2024 Pie Madness Bracket! Full rules for the bracket contest are in the about section.\n\nThe schedule for the 2023 contest will be\n\n- First Round: March 1-5\n\n- Second Round: March 6-10\n\n- Third Round: March 11-15\n\n- Final Four: March 19\n\n[Click here to download a blank 2023 Pie Madness bracket](https://www.dropbox.com/s/lzmjn0zzt1fp98o/PieMadness2023BracketForDownload.pdf?dl=0)\n\nWhich pies are you excited about? What’s disappointing about this bracket? LET’S HEAR IT!"}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "2023 Bracket Released"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "poll": {"S": ""}, "image": {"S": ""}, "timestamp": {"N": "1677002227237"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#8e1230ac-89f1-480a-9e54-4888707297b7"}, "text": {"S": "Pie Madness 2023 is coming! The bracket will be released on February 21 and, as always, voting will begin on March 1. Strap in for another exciting season!"}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Pie Madness 2023 is Approaching!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1677682567725"}, "user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "POST#c4d49d15-b927-4505-885c-f46d1f532865"}, "text": {"S": "Round 1 voting is open!\n\n[Click here](https://forms.gle/SZ2WtVgjYXGcX8Yp9) to vote for your favorite pies!\n\nThe bracket contest is open or submissions until tomorrow, [click here](https://piemadness.com/posts/2023/46b54557-b4fb-4755-8565-dbf4cb110367) if you would like to enter\n\nMay your favorite pie win "}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Round 1 Voting!"}}}}, {"PutRequest": {"Item": {"hasPoll": {"BOOL": false}, "pollTitle": {"NULL": true}, "poll": {"NULL": true}, "image": {"S": ""}, "number": {"N": "0"}, "timestamp": {"N": "1678839465805"}, "user": {"S": "USER#da6404a0-d32c-4e05-8377-319c274c3254"}, "SK": {"S": "POST#d8ef1a53-8b57-426b-8e26-dd9638c2b81d"}, "text": {"S": "Third round voting is live now!\n[Click here](https://forms.gle/kfWpMVy2q5cmUVyD7)to vote "}, "PK": {"S": "POST#CONTEST#2023"}, "title": {"S": "Third round voting!"}}}}, {"PutRequest": {"Item": {"secret": {"S": "805bef57-4r6s-482d-b5d7-c386707e9378"}, "image": {"S": "https://i.pinimg.com/originals/09/42/60/094260c03e66fd5b262c185f224927b0.jpg"}, "lastName": {"S": "Ochoa"}, "timestamp": {"N": "1613943096574"}, "favoritePie": {"S": "pear blue cheese "}, "user": {"S": "Bernardo Ochoa"}, "SK": {"S": "USER#1a20ace3-c3e4-4de7-96ab-6c56ee8d6d18"}, "PK": {"S": "USER#1a20ace3-c3e4-4de7-96ab-6c56ee8d6d18"}, "firstName": {"S": "Bernardo"}}}}, {"PutRequest": {"Item": {"secret": {"S": "61b540c8-ddd7-f213-8088-26c645e96eb7"}, "image": {"S": "https://pie-madness.s3.amazonaws.com/d7f5eea1-5af6-4982-bccc-0e7e870b0215.jpeg"}, "lastName": {"S": "lane"}, "timestamp": {"N": "1678082527781"}, "favoritePie": {"S": ""}, "user": {"S": "evan lane"}, "SK": {"S": "USER#da6404a0-d32c-4e05-8377-319c274c3254"}, "PK": {"S": "USER#da6404a0-d32c-4e05-8377-319c274c3254"}, "firstName": {"S": "evan"}}}}, {"PutRequest": {"Item": {"user": {"S": "USER#cbe4971d-44e0-4caa-ba4c-40716c2e9982"}, "SK": {"S": "COMMENT#a10f1816-072b-4413-872a-28552254abf9"}, "text": {"S": "nice"}, "PK": {"S": "POST#9d62953f-99e4-4abd-8f4f-f261cdd49016"}, "timestamp": {"N": "1647141588778"}}}}, {"PutRequest": {"Item": {"user": {"S": "USER#861f4f6d-4ca1-44af-b05c-25735ed4deca"}, "SK": {"S": "COMMENT#e018c3c4-0fa3-4e11-bfcd-dfa0794251b2"}, "text": {"S": "nice"}, "PK": {"S": "POST#9d62953f-99e4-4abd-8f4f-f261cdd49016"}, "timestamp": {"N": "1647139566927"}}}}, {"PutRequest": {"Item": {"SK": {"S": "NOTIFICATION#USER#861f4f6d-4ca1-44af-b05c-25735ed4deca#POST#9d62953f-99e4-4abd-8f4f-f261cdd49016"}, "post": {"S": "POST#9d62953f-99e4-4abd-8f4f-f261cdd49016"}, "PK": {"S": "NOTIFICATION#USER#861f4f6d-4ca1-44af-b05c-25735ed4deca"}, "title": {"S": "test"}, "timestamp": {"N": "1647141588778"}}}}, {"PutRequest": {"Item": {"secret": {"S": "9477c020-87d5-4b18-05b8-3b676782db72"}, "image": {"S": "https://pie-madness.s3.amazonaws.com/fc1c6cb8-c31c-40a1-9797-50d1f071d236.jpg"}, "lastName": {"S": "Narotsky"}, "timestamp": {"N": "1613940414357"}, "favoritePie": {"S": "Mixed Berry Cobbler"}, "user": {"S": "Andy Narotsky"}, "SK": {"S": "USER#9548bdd3-0c40-41ab-b09e-a9e5efcc4836"}, "PK": {"S": "USER#9548bdd3-0c40-41ab-b09e-a9e5efcc4836"}, "firstName": {"S": "Andy"}}}}]}